## quest
- 범주형/범주형, 연속형/연속형 확증 데이터 검증

In [3]:
import matplotlib.pyplot as plt
import matplotlib as mpl
mpl.rc('font',family='Malgun Gothic')
import seaborn as sns
import pandas as pd
import scipy.stats as stats

In [4]:
df_titanic = pd.read_csv('../../datasets/TitanicFromDisaster_train.csv')
df_titanic[:2]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

### X 범주형 , Y 범주형 : 주로 독립성 증명

#### 선정 변수 : Sex, Survived
- 분석 내용 : 성별에 따라 생존 여부가 달라지는가?
    - 귀무가설 : 성별에 따라  생존 여부가  달라지지 않는다.
    - 대립가설 :  성별에 따라 생존 여부가 달라진다.
- 분석결론 (기준:p-value 0.05) / P.value < 0.05 : 대립 참
    - 통계 결론 : 대립가설 참, 귀무가설 기각 statistic=260, pvalue=1.1e-58,
    - 사실 결론 : 성별에 따라 생존 여부가 달라진다. P.value < 0.05 : 대립 참

In [5]:
# 데이터 변환
df_titanic[['Survived','Pclass']] = df_titanic[['Survived','Pclass']].astype(object)

In [6]:
df_titanic[['Survived', 'Sex']].describe()

        Survived   Sex
count        891   891
unique         2     2
top            0  male
freq         549   577

In [7]:
df_titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    object
 2   Pclass       891 non-null    object
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(3), object(7)
memory usage: 83.7+ KB

In [12]:
df_titanic_category = df_titanic[['Survived', 'Sex']]
df_titanic_category

    Survived     Sex
0          0    male
1          1  female
2          1  female
3          1  female
4          0    male
..       ...     ...
886        0    male
887        1  female
888        0  female
889        1    male
890        0    male

[891 rows x 2 columns]

In [13]:
df_titanic_category.isnull().sum()

Survived    0
Sex         0
dtype: int64

In [14]:
df_titanic_category_pivot = pd.pivot_table(data=df_titanic_category, index='Sex' , columns='Survived', aggfunc=len) # aggfunc=len -> count
df_titanic_category_pivot

Survived    0    1
Sex
female     81  233
male      468  109

In [15]:
stats.chi2_contingency(observed=df_titanic_category_pivot, correction=True) #data는 집계된 data로, correction는 자유도

Chi2ContingencyResult(statistic=260.71702016732104, pvalue=1.1973570627755645e-58, dof=1, expected_freq=array([[193.47474747, 120.52525253],
       [355.52525253, 221.47474747]]))

### X:연속형 / Y:연속형 : 주로 상관관계 확인 
- correlation coefficient(상관계수)
    - -1 ~ 1  
    - 0에 가까우면 관계없음, -1로 갈수록 반비례, 1로 갈수로 정비례

#### 선정 변수: age, Fare
- 분석 내용 : 나이에 따라서 비용 변화가 있는가?
    - 귀무가설 : 나이에 따라서 요금 변화가 없다.
    - 대립가설 : 나이에 따라서 요금 변화가 있다.
- 분석결론 (기준:p-value 0.05) / P.value < 0.05 : 대립 참
    - 통계 결론 : 대립가설 참, 상관계수 비례관계
    - 사실 결론 : 나이에 따라서 요금이 올라간다.statistic=0.096, p-value=0.01)

In [17]:
df_titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    object
 2   Pclass       891 non-null    object
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(3), object(7)
memory usage: 83.7+ KB

In [20]:
df_titanic[['Age','Fare']].describe()

              Age        Fare
count  714.000000  891.000000
mean    29.699118   32.204208
std     14.526497   49.693429
min      0.420000    0.000000
25%     20.125000    7.910400
50%     28.000000   14.454200
75%     38.000000   31.000000
max     80.000000  512.329200

In [22]:
df_age_Fare = df_titanic[['Age','Fare']]
df_age_Fare[:2]

    Age     Fare
0  22.0   7.2500
1  38.0  71.2833

In [23]:
df_age_Fare.isnull().sum()

Age     177
Fare      0
dtype: int64

In [24]:
df_age_Fare = df_age_Fare.dropna().copy()

In [25]:
df_age_Fare.isnull().sum()

Age     0
Fare    0
dtype: int64

In [26]:
df_age_Fare.corr()

           Age      Fare
Age   1.000000  0.096067
Fare  0.096067  1.000000

In [27]:
stats.pearsonr(df_age_Fare['Age'],df_age_Fare['Fare'] )

PearsonRResult(statistic=0.0960666917690389, pvalue=0.010216277504446952)